src/Documents/ЭлектронноеПисьмо/ЭлектронноеПисьмо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭлектронноеПисьмо</name>
  <attributes>
    <name>Получатели</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тело</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef</types>
      <types>TaskRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Вложения</name>
    <attributes>
      <name>Расширение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ЭлектронноеПисьмо/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиПроведения

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение и Не ЗначениеЗаполнено(ДатаОтправки) Тогда 
		Отказ = Не ОтправитьПисьмо();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОтправитьПисьмо() Экспорт
	
	Если БлокировкаРаботыСВнешнимиРесурсамиУКПовтИсп.ЭтоКопияБазы() Тогда
		Сообщить("В копии отправка писем заблокированна");
		Возврат Ложь;
	КонецЕсли;
	
	ДатаОтправки = ТекущаяДатаСеанса();
	
	ПараметрыПисьма = РаботаСПочтовымиСообщениями.ПолучитьПараметрыПисьма();
	ПараметрыПисьма.Тело 			= Тело;
	ПараметрыПисьма.Тема 			= Тема;
	ПараметрыПисьма.АдресПолучателя = Получатели;	
	ПараметрыПисьма = РаботаСПочтовымиСообщениями.ПодготовитьПараметрыПисьма(ПараметрыПисьма);
	ОписаниеОшибки = "";
	ТекущийТекстHTML = ПараметрыПисьма.Тело;
	
	ПочтовыеВложения = Новый ТаблицаЗначений;
	ПочтовыеВложения.Колонки.Добавить("Ключ");
	ПочтовыеВложения.Колонки.Добавить("Значение");
	ПочтовыеВложения.Колонки.Добавить("Расширение");
	
	Для Каждого Вложение Из Вложения Цикл
		
		НоваяСтрока = ПочтовыеВложения.Добавить();
		НоваяСтрока.Ключ = Вложение.Ключ;
		НоваяСтрока.Значение = Вложение.Значение.Получить();
		НоваяСтрока.Расширение = Вложение.Расширение;
		
	КонецЦикла;
	
	Результат = РаботаСПочтовымиСообщениями.ОтправитьСообщение(ПараметрыПисьма, ОписаниеОшибки, ТекущийТекстHTML,, Истина, ПочтовыеВложения);
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		ЗаписьЖурналаРегистрации(
			"РаботаСПочтовымиСообщениями",
			,
			,
			Ссылка,
			СтрШаблон("При отправке электронного письма возникли ошибки.
				|Письмо: %1
				|Ошибки:
				|%2",
				Ссылка,
				ОписаниеОшибки));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
